Program_2/app/controllers/job_seeker_controller.rb

SELECT "job_applications".* FROM "job_applications" WHERE (user_id = 7)
---
  def home
    @job_applications = JobApplication.where(['user_id = ?',session[:user_id]])