Program_2/app/controllers/jobs_controller.rb

  def new
    @job = Job.new
    @current_user = User.find_by_id(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]