Program_2/app/controllers/recruiter_controller.rb

  def new
    current_user = User.find_by_id(session[:user_id])
    @recruiters=User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]

  def view
    current_user = User.find_by_id(session[:user_id])
    puts(current_user)
    @recruiters=User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]

  def edit
    current_user = User.find_by_id(session[:user_id])
    @recruiters=User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]

  def view_jobs
    @jobs=Job.all
    @current_user = User.find_by_id(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]