Program_2/app/controllers/users_controller.rb

  def update

    respond_to do |format|

      if session[:usertype=='2'] then
        #flash[:alert] =  'Article was successfully created.'
        @current_user=User.find_by_id(session[:user_id])

      end

      if @user.update(user_params) then
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
UPDATE "users" SET "company_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["company_id", 3], ["updated_at", "2018-02-25 06:15:45.148098"], ["id", 16]]