Program_2/app/views/users/_form.html.erb

SELECT "companies".* FROM "companies"
---
    <%= form.label :company_id %>
    <%= form.select "company_id",options_from_collection_for_select(Company.all ,"id","name"), {:include_blank => 'No Company'} %>