Program_2/app/views/recruiter/edit.html.erb

SELECT "companies".* FROM "companies" ORDER BY "companies"."name" ASC
---
  <%= f.label :Company  %>
  <%= f.collection_select :company_id, Company.order(:name), :id, :name,{:include_blank => 'No Company'} %>