Program_2/app/views/recruiter/new.html.erb

<br>
<%= unless User.find_by_id(session[:user_id]).company.nil? then link_to 'Create New Job Posting', new_job_path  end %><br><br>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]