Program_2/app/views/recruiter/view.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  <strong>Phone:</strong>&nbsp;<%= @recruiters.phone %><br>
  <strong>Company:</strong>&nbsp;<%= unless User.find_by_id(session[:user_id]).company.nil? then  User.find_by_id(session[:user_id]).company.name end %><br>